package OOP.Seminars_OOP;

public class Seminar001 {
    /*
***Крестьянин***
        Имя;
        Уровень;
        Здоровье;
        Ходить;
        Бегать
        Выносливость;
Сбор урожая;
Снабжение ресурсами;


***Разбойник***
        Имя;
        Уровень;
        Здоровье;
        Ходить;
        Бегать;
        Выносливость;
Воровать;
Атака;
Хитрость;

***Снайпер***
        Имя;
        Уровень;
        Здоровье;
        Ходить;
        Бегать;
        Выносливость;       
Меткость;
Маскировка;
Приближение;
Атака;



***Колдун***
        Имя;
        Уровень;
        Здоровье;
        Ходить;
        Бегать;
        Выносливость;
Магия;
Артифакты;
Атака;
Лечить;

 
***Копейщик***
        Имя;
        Уровень
        здоровье;
        Ходить;
        Бегать;
Выносливость;
Атака;


***Арбалетчик*** //артиллерия
        Имя;
        Уровень;
        Здоровье;
        Ходить;
        Бегать;
Выносливость;
Меткость;


***Монах***
        Имя;
        Уровень;
        Здоровье;
        Ходить;




import Unit.Fermer;
//монах



    
    public static void main(String[] args) {
    Fermer fermer1 = new Fermer("Bob Marly", 100, 0);
    }


    
*/
}
